package ru.jack;

public class Homework {
    /**
     * 1. Создать spring-boot приложение с помощью https://start.spring.io/
     * 2. Создать класс Student с полями: идентификатор, имя, имя группы
     * 3. Создать контроллер, обрабатывающий входящие запросы:
     * 3.1 GET /student/{id} - получить студента по id
     * 3.2 GET /student/ - получить всех студентов
     * 3.3 GET /group/{groupName}/student/ - получить всех студентов группы
     * 3.4 POST /student - создать студента (принимает JSON) (отладиться можно с помощью Postman)
     * 4. При старте приложения в программе должно быть создано 5-10 студентов
     */
}
